Revit 2027 API
EffectInstance.SetEmissiveColor Method
 Sets the emissive color parameter of the effect instance.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetEmissiveColor(
	Color color
)
Public Sub SetEmissiveColor (
	color As Color
)
public:
void SetEmissiveColor(
	Color^ color
)
member SetEmissiveColor :
        color : Color -> unit
Parameters
color Color
 The emissive color value.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace